# # 1. Створити функцію is_superset(), яка приймає 2 сети. Резульатат має виводиться в консоль, одним з повідомлень
# # в залежності від ситуації:
# # 1 - «Суперсет не знайдено»
# # 2 – «Обʼєкт {X} є чистим суперсетом»
# # 3 – «Сети рівні»
#
# # def is_superset(st_1, st_2):
# #     a = set(st_1)
# #     b = set(st_2)
# #
# #     if b > a:
# #         return ("Обʼєкт st_2 є чистим суперсетом")
# #     elif a > b:
# #         return ("Обʼєкт st_1 є чистим суперсетом")
# #     if a == b:
# #         return ("Сети рівні")
# #     else:
# #         return ("Суперсет не знайдено")
# #
# #
# # print(is_superset([1, 2, 3, 4], [1, 2]))
#
# # 2. Створити словник що мітсить в собі 5 страв (ключі) та їх калорійність (значення).
# # Додайте в цей словник ще одну страву та іі калорайність.
# # Після чого кожне значення калорійності замініть на кортеж (калорійність, температура подачі).
# # Вивести всі температури подачі.
#
# # dc_t = {"pizza": 100, "borsh": 50, "hlib": 40, "omlet": 60,}
# # dc_t["tea"] = 70
# # temp_delivery = {"pizza": 50, "borsh": 60, "hlib": 24, "omlet": 55, "tea": 70}
# #
#
#
#
#
# # 3. Створити 3-4 словники з полями імʼя, вік та місто.
# # Ці словники зібрати в список. Пргорама має виводити 3 повідомлення про кодний словник (тобто 9-12 повідомлень) наступного формату:
# # “My … is ...”
# per1 = {'name': 'Max', 'age': 28, 'city': 'Zp'}
# key = ['name', 'age', 'city']
# val = [('Max', 28, 'Zp'), ('Alex', 20, 'NY'), ('Ser', 33, 'LA')]
#
# list_pers = [{k: v for (k, v) in zip(key, b)} for b in val]
# for dict_per in list_pers:
#     print('My name is {}. \nI am {} years old.\nI live in {}.'.format(dict_per['name'], dict_per['age'], dict_per['city']))


a = input()
while True:
    try:
        a_int = int(a)
        print('ok')
        break

    except ValueError as exp:
        print(exp)
        print('int!!!!_MF')
        a = input()
