#_*_ coding: utf-8 _*_
import time
w=time.gmtime()
print("год =",w.tm_year)
print(time.localtime())
print(time.gmtime())
print("=============================================================================")

d=["понедельник","вторник","среда","четверг","пятница","суббота","воскресенье"]
m=["","Январь","Февраль","Март","Апрель","Май","Июнь","Июль","Август","Сентябрь","Октябрь","Ноябрь","Декабрь"]
t= time.localtime()
print("Сегодня:\n%s %s %s %s %d:%02d:%02d\n%02d.%02d.%02d" %(d[t[6]], t[2], m[t[1]], t[0], t[3], t[4], t[5], t[2], t[1], t[0]))
time.sleep(2)
s= "Сегодня:\n%A %d %b %Y %H:%M:%S\n%d.%m.%Y"
print(time.strftime(s))
input()